# 2. თანდართულ ფაილში "persons.txt" მოცემულია ადამიანების სია შემდეგი ფორმატით:
#    სახელი და გვარი, ასაკი, ქალაქი
#
#    Evelyn Cook, 75, Nixonland
#    Dr. Briana Davidson, 22, South Hunterside
#    ...
#    ...
#
#    თქვენი დავალებაა არსებული ფაილიდან წაიკითხოთ ინფორმაცია, შექმნათ ორი ახალი ტექსტური ფაილი (.txt გაფართოებით), ერთ ფაილში
#    ჩაწერეთ ყველა პიროვნება რომლის ასაკი ნაკლებია 50-ზე, ხოლო მეორე ფაილში ჩაწერეთ ყველა პიროვნება, რომლის ასაკი მეტია 50-ზე,
#    ფორმატი დაცული უნდა იყოს ისეთი სახით, როგორიც არის ორიგინალ "persons.txt" ფაილში ანუ თითო პიროვნება თითო ხაზზე!


lst = []
with open('persons.txt', 'r') as persons:
    for line in persons:
        lst.append(line[:-2])

# ბევრნაირად ვცადე, თავიდან მინდოდა append ით გამეკეთებინა, მარა შექმნილ ფაილებს დუბლირებას უკეთებდა და ბოლოს ისევ write ით გამომივიდა.
# საინტერესო იქნება შემდეგ ლექციაზე თქვენ როგორ გააკეთებთ იმიტო რო მგონია რო ზედმეტად რთულად მიწერია და უფრო მარტივადაც უნდა შეიძლებოდეს

with open('hw-11.2-older_than_50.txt', 'w') as older:
    for i in lst:
        k = str(i)
        l = k.split(', ')
        if int(l[1]) > 50:
            older.write(k + '\n')

with open('hw-11.2-younger_than_50.txt', 'w') as younger:
    for i in lst:
        k = str(i)
        l = k.split(', ')
        if int(l[1]) <= 50:
            younger.write(k + '\n')



