# დაწერეთ ფუნქცია რომელიც მომხმარებელს უსასრულოდ შეეკითხება სახელებს და ლისტში დაამატებს ამ სახელებს.
# თუ მომხმარებელი შეიყვანს სიტყვა "stop"-ს, მაგ შემთხვევაში გაჩერდეს პროგრამა და დააბრუნოს ეს ლისტი.
# გაითვალისწინეთ: "stop" სიტყვა არ უნდა ჩაამატოთ ლისტში!
# გაითვალისწინეთ: ფუნქცია არ იღებს არანაირ პარამეტრს


def user_list():
    l1 = []
    while True:
        user_name = input('sheiyvanet saxeli: ')
        if user_name == 'stop':
            break
        l1.append(user_name)

    return l1

print(user_list())
