# 4. ჩავთვალოთ რომ გვაქვს აპარატი, რომელშიც უნდა გადავიხადოთ რაღაც სერვისის გადასახადი, რომლის ღირებულებაც არის 50 ლარი,
# ხოლო აპარატი იღებს მხოლოდ 5, 10 და 20 ლარიან კუპიურებს და გვიბრუნებს ასევე ხურდას.
#
# დაწერეთ პროგრამა, რომელიც ბეჭდავს გადასახადი თანხის ოდენობას, შემდეგ მომხმარებელს სთხოვს მოათავსოს კუპიურა,
# თუ კუპიურა არ არის ვალიდური, დაბეჭდოს რომ შეიტანოს ვალიდური კუპიურა. თუ კუპიურა ვალიდურია, დაბეჭდოს რაც დარჩა
# გადასახდელი თანხა და კვლავ სთხოვოს მომხმარებელს კუპიურის
# მოთავსება, მანამ სანამ, გადასახდელი თანხა არ განულდება. ბოლოს კი დაუწეროს რამდენი ეკუთვნის ხურდა. ანუ ბოლო იტერაციაზე თუ დარჩენილია
# მაგალითად გადასახდელი თანხა 10 ლარი და მომხმარებელი შეიტანს 20 ლარიანს, დაუწეროს რომ ეკუთვნის 10 ლარი ხურდა.


price = 50


while price > 0:

    bill = int(input(f"You have to pay {price} gel. (please enter 5, 10 or 20 gel bill): "))
    if bill == 5:
        price -= bill
    elif bill == 10:
        price -= bill
    elif bill == 20:
        price -= bill
    else:
        print('please enter valid bill(5,10 or 20)')

if price == 0:
    print(f'You have succesfully paid your fee. your balance is {price} gel. Thank you!')
else:
    print(f'You have succesfully paid your fee and here is your change: {price.__abs__()} gel.')
    #abs ანუ რიცხვის მოდული იმისთვის რომ უარყოფითი რიცხვი გაადადებითოს.
